countryList = [
    "США", "Канада", "Бразилия", "Аргентина", "Германия", 
    "Франция", "Испания", "Италия", "Великобритания", "Россия",
    "Китай", "Япония", "Индия", "Австралия", "Мексика",
    "Египет", "ЮАР", "Саудовская Аравия", "Турция", "Украина",
    "Швеция", "Норвегия", "Финляндия", "Польша", "Швейцария",
    "Нидерланды", "Греция", "Южная Корея", "Таиланд", "Вьетнам"
  ];
  

var select = "<select>"

for(item of countryList){
    select += "<option>"+item+"</option>"
}


select += "</select>"

document.write(select)



var table = "<table border='1' cellpadding='10'>";  // Создаем таблицу с границами и отступами внутри ячеек
var counter = 1;  // Счетчик для порядковых номеров

for (var i = 0; i < 8; i++) {  // Внешний цикл для строк
    table += "<tr>";  // Открываем строку таблицы

    for (var j = 0; j < 8; j++) {  // Внутренний цикл для ячеек
        table += "<td style='text-align: center;'>" + counter + "</td>";  // Вставляем значение счетчика в ячейку и выравниваем текст по центру
        counter++;  // Увеличиваем счетчик на 1
    }

    table += "</tr>";  // Закрываем строку таблицы
}

table += "</table>";  // Закрываем таблицу

document.write(table);  // Выводим таблицу на страницу
